{"meta":{"version":1,"warehouse":"4.0.2"},"models":{"Asset":[{"_id":"themes/concise/source/css/style.styl","path":"css/style.styl","modified":1,"renderable":1},{"_id":"themes/concise/source/images/favicon.ico","path":"images/favicon.ico","modified":1,"renderable":1}],"Cache":[{"_id":"source/categories/index.md","hash":"6a8a8b318f5ad3db71c53007877f13667fe218fa","modified":1662115049472},{"_id":"source/tags/index.md","hash":"e056960baf8d606a3d76f0fd8dc9ce350110dce0","modified":1662115050763},{"_id":"source/_posts/Why-is-Esports-growing-so-fast.md","hash":"872638fe342dd1b5f920752dc5d29d02d17e46a1","modified":1662115081786},{"_id":"themes/concise/source/css/_base/utils.styl","hash":"da39a3ee5e6b4b0d3255bfef95601890afd80709","modified":1661931484000},{"_id":"themes/concise/LICENSE","hash":"e1c46234db5aa8df621c00af3226cdfab787e051","modified":1661931484000},{"_id":"themes/concise/README.md","hash":"1238e18bf2d424a2f15e9bb6700bde069809592f","modified":1661931484000},{"_id":"themes/concise/custom.json","hash":"6a64cf736ea940aafcf70de8cf2267a59280c323","modified":1661941640000},{"_id":"themes/concise/_config.yml","hash":"eb2ec25a38ddb964dd41c194940258afae70360f","modified":1662115048136},{"_id":"themes/concise/npm-debug.log","hash":"ed74cf97e722eb2edbdc29adc11e9f472c51c6c8","modified":1661931484000},{"_id":"themes/concise/layout/category.ejs","hash":"9b740fc33f6f028df60f0bc4312bf3ebd03aa8ea","modified":1661931484000},{"_id":"themes/concise/layout/archive.ejs","hash":"a18842e3d719fe3ca9b977a6995f8facc75c8673","modified":1661931484000},{"_id":"themes/concise/layout/layout.ejs","hash":"a7c3abd74ad481acaccc2524f081bd7b902d31eb","modified":1661931484000},{"_id":"themes/concise/layout/index.ejs","hash":"c7cf84c84c26f1adfc249bc9a7605206fa245f73","modified":1661931484000},{"_id":"themes/concise/layout/page.ejs","hash":"70cbc9854655773cc6ba84eecaaf330fed430465","modified":1661931484000},{"_id":"themes/concise/layout/post.ejs","hash":"70cbc9854655773cc6ba84eecaaf330fed430465","modified":1661931484000},{"_id":"themes/concise/layout/tag.ejs","hash":"45150a2365768b6b67880193c9264ad2bb4814db","modified":1661931484000},{"_id":"themes/concise/languages/de.yml","hash":"1ebe2d4f1b48c84e004c933bec65731fb54c9998","modified":1661931484000},{"_id":"themes/concise/languages/default.yml","hash":"5a3b9055a568799a5aa4f3546a369f9659982a81","modified":1661931484000},{"_id":"themes/concise/languages/es.yml","hash":"727707b95580bbe9773edef4c84a9735fd537742","modified":1661931484000},{"_id":"themes/concise/languages/pl.yml","hash":"19313b4c80c50196c364afe932dad3a975782817","modified":1661931484000},{"_id":"themes/concise/languages/zh-CN.yml","hash":"751f1a2bbfb6736c71e846493ae0fb7ef7dc778d","modified":1661931484000},{"_id":"themes/concise/languages/ru.yml","hash":"37161bb9b6cc2dae1f53837185be32e7a0b8abfa","modified":1661931484000},{"_id":"themes/concise/languages/no.yml","hash":"d9a1b34d590f94ab5c03809754e62bc4cf0e8d0f","modified":1661931484000},{"_id":"themes/concise/languages/zh-TW.yml","hash":"b2474b775a8fa0fa3e9e3c58ddb11b20cf65dbc5","modified":1661931484000},{"_id":"themes/concise/layout/_partial/footer.ejs","hash":"d1842fa7ef3b0cff7d9ef3235138f42285d6cac4","modified":1661940112000},{"_id":"themes/concise/layout/_partial/google_analytics.ejs","hash":"d70d287956e90e99ba35b2e14cefb477f9203aa0","modified":1661931484000},{"_id":"themes/concise/layout/_partial/after_footer.ejs","hash":"b5979307b6f375dd9e899a993cd103c1d9e6acde","modified":1661931484000},{"_id":"themes/concise/layout/_partial/comment.ejs","hash":"d687dff9ba87e350994745ad933a5d6e3ce7bb46","modified":1661931484000},{"_id":"themes/concise/layout/_partial/archive.ejs","hash":"d0d3854021179c93cb72b4adb01439c22b30f2bb","modified":1661931484000},{"_id":"themes/concise/layout/_partial/article.ejs","hash":"f67006a4d62145ea12a63d5672d3538ed24c5c4f","modified":1661931484000},{"_id":"themes/concise/layout/_partial/pagination.ejs","hash":"5a3c65842354b04c7839c915c045d39be9342cdf","modified":1661931484000},{"_id":"themes/concise/layout/_partial/head.ejs","hash":"7bc2e10a2e8d0599541024988fe59a27e3d051e8","modified":1661941654000},{"_id":"themes/concise/layout/_partial/header.ejs","hash":"5122ded49caa89d396fad37c0bfd7bea80c44a12","modified":1661931484000},{"_id":"themes/concise/layout/_partial/sidebar.ejs","hash":"016441ca9534769d8e151cffe4027686e9c86f18","modified":1661931484000},{"_id":"themes/concise/layout/_widget/category.ejs","hash":"c163a146b0f963f257ddcc244f413bef281fe0a0","modified":1661931484000},{"_id":"themes/concise/layout/_widget/recent_posts.ejs","hash":"59f6f8362fa23a6215e3381151a59c2e2a5fd0d3","modified":1661931484000},{"_id":"themes/concise/layout/_widget/search.ejs","hash":"0369db7eaab8bdad9778026b709c33824d21a67f","modified":1661940188000},{"_id":"themes/concise/layout/_widget/tagcloud.ejs","hash":"139e91b1e6abcc1e3883bcc03a9a1a7f1d891d7a","modified":1661931484000},{"_id":"themes/concise/source/css/style.styl","hash":"8e8458e78717c49c4ff278b741258d77301f6be4","modified":1661931484000},{"_id":"themes/concise/layout/_widget/tag.ejs","hash":"6bf8214fedb8d6306e017e07ad67aab956496500","modified":1661931484000},{"_id":"themes/concise/layout/_partial/post/gallery.ejs","hash":"fc23ef9b5a412e05436f68ff47146b860d2d4225","modified":1661931484000},{"_id":"themes/concise/layout/_partial/post/category.ejs","hash":"8bb3f6ee6296df5a0d527b30d5a46a2387b97cb7","modified":1661931484000},{"_id":"themes/concise/layout/_partial/post/share.ejs","hash":"991cf130c37f08c7e948772fb45587592b165b55","modified":1661931484000},{"_id":"themes/concise/layout/_partial/post/title.ejs","hash":"7f93b310927d6238effdde15234d8cb242940893","modified":1661931484000},{"_id":"themes/concise/layout/_partial/post/tag.ejs","hash":"b21bbfb5479bd5968a610ba8bdb2bdf10d7a40e9","modified":1661931484000},{"_id":"themes/concise/source/css/_base/layout.styl","hash":"4b8f52a6b09e77919afa00d192e68344f6e0c42c","modified":1661931484000},{"_id":"themes/concise/source/css/_partial/archive.styl","hash":"3203b8f346eb637687b1e7fd6e633c078ebf8bf1","modified":1661931484000},{"_id":"themes/concise/source/css/_partial/article.styl","hash":"e3737e778a85ba22075689f1f10e281c134d2d1d","modified":1661931484000},{"_id":"themes/concise/source/css/_partial/comment.styl","hash":"6fa67d96903ac3b1674e6c8d4c801e16115808e0","modified":1661931484000},{"_id":"themes/concise/source/css/_partial/footer.styl","hash":"821d50a9d45afec0274e1e64c2b37a71f3611c01","modified":1661931484000},{"_id":"themes/concise/source/css/_base/variable.styl","hash":"c6640fa3724dfa2cf6b61824eec71a90bfe13299","modified":1661931484000},{"_id":"themes/concise/source/css/_partial/header.styl","hash":"01b597c1862cecc41534a1f91447c0100ec0675c","modified":1661931484000},{"_id":"themes/concise/source/css/_partial/index.styl","hash":"fa5799fdc3840c1df8c6386d4a8044f667bf9a64","modified":1661931484000},{"_id":"themes/concise/source/images/favicon.ico","hash":"13bd71fd2d3dbe382f55d22edc5d3e66c072b073","modified":1661942328000},{"_id":"themes/concise/source/css/_partial/sidebar.styl","hash":"4872edb1b31c5654ac83ae2f5cfa0b3cec10eff6","modified":1661931484000},{"_id":"themes/concise/source/css/_partial/syntax.styl","hash":"196537caeea329ea48111fc1bb9d3c9ae3c40df3","modified":1661931484000},{"_id":"public/categories/index.html","hash":"3234b9b2f92354fe4aa3af54bd7b3dd14b08ca00","modified":1662115082706},{"_id":"public/tags/index.html","hash":"a2c451a399b6d8aae66f38fa3f4d6ff4dc0a2a11","modified":1662115082706},{"_id":"public/archives/index.html","hash":"31818d023d0b68df648ea0b3b8379b920a5531a9","modified":1662115082706},{"_id":"public/categories/Esports/index.html","hash":"fbcc2c9bcf89c800a4bf41f22bee1ff70eac4294","modified":1662115082706},{"_id":"public/2022/Why-is-Esports-growing-so-fast/index.html","hash":"5ca9cf9ac1b4ebb37a869848fb2ff1d8de2fa0a7","modified":1662115082706},{"_id":"public/archives/2022/09/index.html","hash":"a843345674cd6a3276abf1cf5b6f41fa7818b927","modified":1662115082706},{"_id":"public/archives/2022/index.html","hash":"7a5d929da802e41fbb07c16f619738c13f094023","modified":1662115082706},{"_id":"public/index.html","hash":"3a27b4cdb36145aaf208e094c83e40ea65f27389","modified":1662115082706},{"_id":"public/images/favicon.ico","hash":"13bd71fd2d3dbe382f55d22edc5d3e66c072b073","modified":1662115082706},{"_id":"public/css/style.css","hash":"1f190e73a134200c5d52e28ebee6214e5471bb94","modified":1662115082706}],"Category":[{"name":"Esports","_id":"cl7kcem2j0003s8v50kyy8w43"}],"Data":[],"Page":[{"title":"categories","date":"2022-09-02T10:37:29.000Z","type":"categories","layout":"categories","_content":"","source":"categories/index.md","raw":"---\ntitle: categories\ndate: 2022-09-02 18:37:29\ntype: \"categories\"\nlayout: \"categories\"\n---\n","updated":"2022-09-02T10:37:29.472Z","path":"categories/index.html","comments":1,"_id":"cl7kcem260000s8v5coh07tgm","content":"","site":{"data":{}},"excerpt":"","more":""},{"title":"tags","date":"2022-09-02T10:37:30.000Z","type":"tags","layout":"tags","_content":"","source":"tags/index.md","raw":"---\ntitle: tags\ndate: 2022-09-02 18:37:30\ntype: \"tags\"\nlayout: \"tags\"\n---\n","updated":"2022-09-02T10:37:30.763Z","path":"tags/index.html","comments":1,"_id":"cl7kcem2h0002s8v5783phzx1","content":"","site":{"data":{}},"excerpt":"","more":""}],"Post":[{"title":"Why is Esports growing so fast","date":"2022-09-02T10:38:01.000Z","_content":"\n\n#  Why is Esports growing so fast?\n\n Esports is growing exponentially. This statement seems to be backed up by the fact that the global esports market is expected to grow from $696 million in 2017 to $1.5 billion by 2020, attaining a Compound Annual Growth Rate (CAGR) of 26.7%.\n\nA variety of factors are contributing to this rapid growth. Esport’s viewership numbers continue to rise; according to Newzoo, in 2017 there were over 380 million people worldwide who watched an esport event at least once a month, and this is expected to grow to 545 million by 2020. There are many reasons for this growth; Esports provides an opportunity for audiences to see competitive gaming at the highest level, it is easily accessible thanks to online streaming platforms such as Twitch, and gaming itself is becoming more mainstream with each year that passes. In addition, brands are beginning to see the potential in advertising through eSports events and platforms, which will only add fuel to the fire as the industry continues to grow.\n\nEsports has also begun branching out into other areas beyond just video gaming. For example, there are now major League of Legends tournaments being held in stadiums packed with fans, and teams are starting to be signed by professional sports clubs such as NBA’s Golden State Warriors and NFL’s Philadelphia Eagles. The potential for income within eSports is also beginning to be realised; Michael Morhaime, CEO of Activision Blizzard (the company behind games such as World of Warcraft, Hearthstone and Starcraft), said in a recent earnings call that they plan to invest $500 million into eSports in the next three years alone. This investment will go towards creating new leagues and expanding current ones, building new arenas around the world and expanding live broadcasts of events.\n\nAs you can see, there are many reasons why Esports is growing so rapidly - it provides an enjoyable experience for viewers, it is easily accessible and mainstream, brands are beginning to invest heavily and it is branching out into other areas. With all of these factors working together, it seems safe to say that the growth of Esports is only going to continue for many years to come.\n\n#  What are the benefits of Esports?\n\nThe global phenomenon that is Esports is continuing to grow in popularity, with new tournaments and leagues cropping up all the time. Esports is now a multi-billion dollar industry, and viewership for major events regularly exceeds that of traditional sporting fixtures. So what are the benefits of Esports?\n\nThere are many reasons why Esports is so popular, but here are just a few of the key benefits:\n\n1. Esport athletes are often young, fit, and healthy.\n\nDue to the physicality of some Esports games, many professional players are in excellent shape. This is in contrast to traditional sports stars who are often older and more susceptible to injury.\n\n2. Esport athletes are typically highly skillful.\n\nEsports games require good hand-eye coordination as well as strategic thinking skills. As a result, professional players tend to be extremely skilled at playing their chosen game.\n\n3. Esport athletes are typically well-paid.\n\n MLG’s report on “The State of the Industry: 2017” showed that the average salary for an Esports athlete was $62,000 per year. This is in comparison to the average salary for a professional basketball player of $5 million per year. Clearly, there is potential for high earnings in Esports!\n\n#  What industries is Esports impacting?\n\nThe Esports industry is continuing to grow, with new opportunities arising for those involved. But which industries is Esports impacting?\n\nOne of the most obvious industries that Esports is impacting is the media industry. With spectators tuning in to watch tournaments and matches online and on TV, broadcasters are starting to take notice. In 2017, NBC Sports Group announced a multi-year agreement with ESL to broadcast the Intel Extreme Masters (IEM) worldwide. The deal saw coverage of various Esports tournaments on NBC networks such as NBC, NBCSN, and CNBC, as well as streaming on various digital platforms.\n\nThis was followed up by Disney in 2018, when it announced an agreement with BAMTech (a subsidiary of Disney) to create a new dedicated ESPN+ Esport channel. The channel will air hundreds of live events per year, as well as on-demand content from some of the biggest names in Esports. This further cements Esports’ place in the mainstream media industry.\n\nAnother industry that Esports is impacting is the video game industry. With competitive games such as League of Legends and DOTA 2 becoming popular spectator sports, developers are taking note. They are now designing their games with competitive features and spectating in mind, in a bid to attract and retain players. This has led to a rise in competitive gaming titles, which in turn has helped to drive the growth of the Esports industry.\n\nEsports is also having an impact on the marketing industry. With brands eager to tap into the lucrative Esports market, agencies are starting to offer dedicated services catering to this sector. From activations at major tournaments to creating branded content, agencies are helping brands reach out to the valuable Millennial demographic that participates in Esports.\n\nIt’s clear that Esports is having a significant impact on multiple industries. As its popularity continues to grow, we can expect even more industries to be impacted in the future.\n\n#  How does Esports compare to traditional sports?\n\nThere is no one right answer to this question as Esports and traditional sports differ greatly in terms of their histories, structures, and audiences. However, there are some aspects of Esports that may give it an advantage over traditional sports.\n\nFor one, Esports is growing at a much faster pace than traditional sports. In 2017, global revenue from Esports was estimated at $696 million, and it is expected to reach $1.5 billion by 2020[1]. This growth can be attributed to a number of factors, including the increasing popularity of online streaming platforms like Twitch, as well as the rising WCG (World Cyber Games) prize pools. Traditional sports, on the other hand, are seeing much slower growth rates. For example, global revenue for the NFL (National Football League) was estimated at $14 billion in 2017 and is projected to grow to only $19 billion by 2023[2].\n\nAnother aspect in which Esports beats out traditional sports is in terms of viewership. The World Cup final between France and Croatia had an audience of about 3.4 million viewers[3], while the League of Legends World Championships final drew in nearly 100 million viewers[4]. This is largely due to the fact that Esports is broadcast online, whereas traditional sports are typically only available on television. As more and more people switch over to streaming services like Netflix and Hulu, the audience for Esports will continue to grow.\n\nThe final factor that could give Esports an edge over traditional sports is its structure. In most cases, Esport tournaments are organized and run by private companies or by gamers themselves, whereas traditional sports are organized and regulated by national or international sporting organizations. This gives Esports a lot more flexibility in terms of how it operates and what kinds of games can be played. For example, the NFL has very strict rules about what players can and cannot do during a game, while Riot Games (the company behind League of Legends) can adjust the game mechanics as they see fit in order to create a more enjoyable experience for players and spectators.\n\nDespite these advantages, it's important to note that traditional sports still have many advantages over Esports. For example, traditional sports are often tied to national pride and generate significant revenue from tickets sales, advertising, and broadcasting deals. Additionally, traditional sports offer a sense of community that is not always found in Esports communities. Players and fans alike can meet up in person and discuss their favorite teams or players, something that is not possible with online-only games like League of Legends or Counter-Strike: Global Offensive.\n\nIn conclusion, while Esports may not be able to overtake traditional sports just yet, it does have some unique advantages that could lead to even greater growth in the future.\n\n#  What challenges does Esports face?\n\nWith Esports becoming a more mainstream activity, various challenges have arisen that the industry must now face. With such rapid growth, there are many different aspects of Esports that require further development in order to create a sustainable and healthy ecosystem.\n\nThe first challenge is the need for a solid infrastructure. This includes having enough quality venues to hold tournaments as well as a well-developed broadcasting system. In order to truly tap into Esports’ commercial potential, sponsors and other third-party investors need to be able to see value in the space. A well-functioning infrastructure would not only provide this stability but also give fans a better experience.\n\nA second challenge is the lack of regulatory frameworks within the industry. This has led to inconsistent treatment of players and teams as well as different interpretations of what Esports actually is. Without proper regulation, it is difficult for businesses within Esports to plan for the long term and investors are hesitant to put money into what is seen as an unregulated market.\n\nA third challenge lies in the way that Esports are currently marketed. Oftentimes, sponsors and broadcasters focus on the violence and aggression aspects of Esports rather than on the competitive and strategic elements which appeal to many fans. Additionally, there is often a disconnection between players and fans which can hinder the growth of grassroots support for teams and players. Addressing these marketing challenges will be key in expanding the audience for Esports.\n\nFourth, there is still a lack of understanding about Esports from traditional sports institutions such as governing bodies and sports media outlets. This can lead to exclusion from important conversations about traditional sports as well as missed opportunities for collaboration between Esports and traditional sports organisations. Developing positive relationships with these groups will be essential for legitimising Esports in the eyes of wider society.\n\nFinally, one of the most pressing challenges for Esports is overcoming its negative image among some members of society who see it as childish or irrelevant. Addressing these prejudices will require concerted effort from all stakeholders in the Esports industry while also stressing that competitive gaming can be rewarding both financially and mentally/emotionally for participants.\n\nIn conclusion, while there are several challenges facing Esports at present, they are by no means insurmountable. If industry stakeholders work together to address these issues, then there is great potential for continued growth in this dynamic field","source":"_posts/Why-is-Esports-growing-so-fast.md","raw":"---\ntitle: Why is Esports growing so fast\ndate: 2022-09-02 18:38:01\ncategories:\n- Esports\ntags:\n---\n\n\n#  Why is Esports growing so fast?\n\n Esports is growing exponentially. This statement seems to be backed up by the fact that the global esports market is expected to grow from $696 million in 2017 to $1.5 billion by 2020, attaining a Compound Annual Growth Rate (CAGR) of 26.7%.\n\nA variety of factors are contributing to this rapid growth. Esport’s viewership numbers continue to rise; according to Newzoo, in 2017 there were over 380 million people worldwide who watched an esport event at least once a month, and this is expected to grow to 545 million by 2020. There are many reasons for this growth; Esports provides an opportunity for audiences to see competitive gaming at the highest level, it is easily accessible thanks to online streaming platforms such as Twitch, and gaming itself is becoming more mainstream with each year that passes. In addition, brands are beginning to see the potential in advertising through eSports events and platforms, which will only add fuel to the fire as the industry continues to grow.\n\nEsports has also begun branching out into other areas beyond just video gaming. For example, there are now major League of Legends tournaments being held in stadiums packed with fans, and teams are starting to be signed by professional sports clubs such as NBA’s Golden State Warriors and NFL’s Philadelphia Eagles. The potential for income within eSports is also beginning to be realised; Michael Morhaime, CEO of Activision Blizzard (the company behind games such as World of Warcraft, Hearthstone and Starcraft), said in a recent earnings call that they plan to invest $500 million into eSports in the next three years alone. This investment will go towards creating new leagues and expanding current ones, building new arenas around the world and expanding live broadcasts of events.\n\nAs you can see, there are many reasons why Esports is growing so rapidly - it provides an enjoyable experience for viewers, it is easily accessible and mainstream, brands are beginning to invest heavily and it is branching out into other areas. With all of these factors working together, it seems safe to say that the growth of Esports is only going to continue for many years to come.\n\n#  What are the benefits of Esports?\n\nThe global phenomenon that is Esports is continuing to grow in popularity, with new tournaments and leagues cropping up all the time. Esports is now a multi-billion dollar industry, and viewership for major events regularly exceeds that of traditional sporting fixtures. So what are the benefits of Esports?\n\nThere are many reasons why Esports is so popular, but here are just a few of the key benefits:\n\n1. Esport athletes are often young, fit, and healthy.\n\nDue to the physicality of some Esports games, many professional players are in excellent shape. This is in contrast to traditional sports stars who are often older and more susceptible to injury.\n\n2. Esport athletes are typically highly skillful.\n\nEsports games require good hand-eye coordination as well as strategic thinking skills. As a result, professional players tend to be extremely skilled at playing their chosen game.\n\n3. Esport athletes are typically well-paid.\n\n MLG’s report on “The State of the Industry: 2017” showed that the average salary for an Esports athlete was $62,000 per year. This is in comparison to the average salary for a professional basketball player of $5 million per year. Clearly, there is potential for high earnings in Esports!\n\n#  What industries is Esports impacting?\n\nThe Esports industry is continuing to grow, with new opportunities arising for those involved. But which industries is Esports impacting?\n\nOne of the most obvious industries that Esports is impacting is the media industry. With spectators tuning in to watch tournaments and matches online and on TV, broadcasters are starting to take notice. In 2017, NBC Sports Group announced a multi-year agreement with ESL to broadcast the Intel Extreme Masters (IEM) worldwide. The deal saw coverage of various Esports tournaments on NBC networks such as NBC, NBCSN, and CNBC, as well as streaming on various digital platforms.\n\nThis was followed up by Disney in 2018, when it announced an agreement with BAMTech (a subsidiary of Disney) to create a new dedicated ESPN+ Esport channel. The channel will air hundreds of live events per year, as well as on-demand content from some of the biggest names in Esports. This further cements Esports’ place in the mainstream media industry.\n\nAnother industry that Esports is impacting is the video game industry. With competitive games such as League of Legends and DOTA 2 becoming popular spectator sports, developers are taking note. They are now designing their games with competitive features and spectating in mind, in a bid to attract and retain players. This has led to a rise in competitive gaming titles, which in turn has helped to drive the growth of the Esports industry.\n\nEsports is also having an impact on the marketing industry. With brands eager to tap into the lucrative Esports market, agencies are starting to offer dedicated services catering to this sector. From activations at major tournaments to creating branded content, agencies are helping brands reach out to the valuable Millennial demographic that participates in Esports.\n\nIt’s clear that Esports is having a significant impact on multiple industries. As its popularity continues to grow, we can expect even more industries to be impacted in the future.\n\n#  How does Esports compare to traditional sports?\n\nThere is no one right answer to this question as Esports and traditional sports differ greatly in terms of their histories, structures, and audiences. However, there are some aspects of Esports that may give it an advantage over traditional sports.\n\nFor one, Esports is growing at a much faster pace than traditional sports. In 2017, global revenue from Esports was estimated at $696 million, and it is expected to reach $1.5 billion by 2020[1]. This growth can be attributed to a number of factors, including the increasing popularity of online streaming platforms like Twitch, as well as the rising WCG (World Cyber Games) prize pools. Traditional sports, on the other hand, are seeing much slower growth rates. For example, global revenue for the NFL (National Football League) was estimated at $14 billion in 2017 and is projected to grow to only $19 billion by 2023[2].\n\nAnother aspect in which Esports beats out traditional sports is in terms of viewership. The World Cup final between France and Croatia had an audience of about 3.4 million viewers[3], while the League of Legends World Championships final drew in nearly 100 million viewers[4]. This is largely due to the fact that Esports is broadcast online, whereas traditional sports are typically only available on television. As more and more people switch over to streaming services like Netflix and Hulu, the audience for Esports will continue to grow.\n\nThe final factor that could give Esports an edge over traditional sports is its structure. In most cases, Esport tournaments are organized and run by private companies or by gamers themselves, whereas traditional sports are organized and regulated by national or international sporting organizations. This gives Esports a lot more flexibility in terms of how it operates and what kinds of games can be played. For example, the NFL has very strict rules about what players can and cannot do during a game, while Riot Games (the company behind League of Legends) can adjust the game mechanics as they see fit in order to create a more enjoyable experience for players and spectators.\n\nDespite these advantages, it's important to note that traditional sports still have many advantages over Esports. For example, traditional sports are often tied to national pride and generate significant revenue from tickets sales, advertising, and broadcasting deals. Additionally, traditional sports offer a sense of community that is not always found in Esports communities. Players and fans alike can meet up in person and discuss their favorite teams or players, something that is not possible with online-only games like League of Legends or Counter-Strike: Global Offensive.\n\nIn conclusion, while Esports may not be able to overtake traditional sports just yet, it does have some unique advantages that could lead to even greater growth in the future.\n\n#  What challenges does Esports face?\n\nWith Esports becoming a more mainstream activity, various challenges have arisen that the industry must now face. With such rapid growth, there are many different aspects of Esports that require further development in order to create a sustainable and healthy ecosystem.\n\nThe first challenge is the need for a solid infrastructure. This includes having enough quality venues to hold tournaments as well as a well-developed broadcasting system. In order to truly tap into Esports’ commercial potential, sponsors and other third-party investors need to be able to see value in the space. A well-functioning infrastructure would not only provide this stability but also give fans a better experience.\n\nA second challenge is the lack of regulatory frameworks within the industry. This has led to inconsistent treatment of players and teams as well as different interpretations of what Esports actually is. Without proper regulation, it is difficult for businesses within Esports to plan for the long term and investors are hesitant to put money into what is seen as an unregulated market.\n\nA third challenge lies in the way that Esports are currently marketed. Oftentimes, sponsors and broadcasters focus on the violence and aggression aspects of Esports rather than on the competitive and strategic elements which appeal to many fans. Additionally, there is often a disconnection between players and fans which can hinder the growth of grassroots support for teams and players. Addressing these marketing challenges will be key in expanding the audience for Esports.\n\nFourth, there is still a lack of understanding about Esports from traditional sports institutions such as governing bodies and sports media outlets. This can lead to exclusion from important conversations about traditional sports as well as missed opportunities for collaboration between Esports and traditional sports organisations. Developing positive relationships with these groups will be essential for legitimising Esports in the eyes of wider society.\n\nFinally, one of the most pressing challenges for Esports is overcoming its negative image among some members of society who see it as childish or irrelevant. Addressing these prejudices will require concerted effort from all stakeholders in the Esports industry while also stressing that competitive gaming can be rewarding both financially and mentally/emotionally for participants.\n\nIn conclusion, while there are several challenges facing Esports at present, they are by no means insurmountable. If industry stakeholders work together to address these issues, then there is great potential for continued growth in this dynamic field","slug":"Why-is-Esports-growing-so-fast","published":1,"updated":"2022-09-02T10:38:01.786Z","comments":1,"layout":"post","photos":[],"link":"","_id":"cl7kcem2b0001s8v5garh96k9","content":"<h1 id=\"Why-is-Esports-growing-so-fast\"><a href=\"#Why-is-Esports-growing-so-fast\" class=\"headerlink\" title=\"Why is Esports growing so fast?\"></a>Why is Esports growing so fast?</h1><p> Esports is growing exponentially. This statement seems to be backed up by the fact that the global esports market is expected to grow from $696 million in 2017 to $1.5 billion by 2020, attaining a Compound Annual Growth Rate (CAGR) of 26.7%.</p>\n<p>A variety of factors are contributing to this rapid growth. Esport’s viewership numbers continue to rise; according to Newzoo, in 2017 there were over 380 million people worldwide who watched an esport event at least once a month, and this is expected to grow to 545 million by 2020. There are many reasons for this growth; Esports provides an opportunity for audiences to see competitive gaming at the highest level, it is easily accessible thanks to online streaming platforms such as Twitch, and gaming itself is becoming more mainstream with each year that passes. In addition, brands are beginning to see the potential in advertising through eSports events and platforms, which will only add fuel to the fire as the industry continues to grow.</p>\n<p>Esports has also begun branching out into other areas beyond just video gaming. For example, there are now major League of Legends tournaments being held in stadiums packed with fans, and teams are starting to be signed by professional sports clubs such as NBA’s Golden State Warriors and NFL’s Philadelphia Eagles. The potential for income within eSports is also beginning to be realised; Michael Morhaime, CEO of Activision Blizzard (the company behind games such as World of Warcraft, Hearthstone and Starcraft), said in a recent earnings call that they plan to invest $500 million into eSports in the next three years alone. This investment will go towards creating new leagues and expanding current ones, building new arenas around the world and expanding live broadcasts of events.</p>\n<p>As you can see, there are many reasons why Esports is growing so rapidly - it provides an enjoyable experience for viewers, it is easily accessible and mainstream, brands are beginning to invest heavily and it is branching out into other areas. With all of these factors working together, it seems safe to say that the growth of Esports is only going to continue for many years to come.</p>\n<h1 id=\"What-are-the-benefits-of-Esports\"><a href=\"#What-are-the-benefits-of-Esports\" class=\"headerlink\" title=\"What are the benefits of Esports?\"></a>What are the benefits of Esports?</h1><p>The global phenomenon that is Esports is continuing to grow in popularity, with new tournaments and leagues cropping up all the time. Esports is now a multi-billion dollar industry, and viewership for major events regularly exceeds that of traditional sporting fixtures. So what are the benefits of Esports?</p>\n<p>There are many reasons why Esports is so popular, but here are just a few of the key benefits:</p>\n<ol>\n<li>Esport athletes are often young, fit, and healthy.</li>\n</ol>\n<p>Due to the physicality of some Esports games, many professional players are in excellent shape. This is in contrast to traditional sports stars who are often older and more susceptible to injury.</p>\n<ol start=\"2\">\n<li>Esport athletes are typically highly skillful.</li>\n</ol>\n<p>Esports games require good hand-eye coordination as well as strategic thinking skills. As a result, professional players tend to be extremely skilled at playing their chosen game.</p>\n<ol start=\"3\">\n<li>Esport athletes are typically well-paid.</li>\n</ol>\n<p> MLG’s report on “The State of the Industry: 2017” showed that the average salary for an Esports athlete was $62,000 per year. This is in comparison to the average salary for a professional basketball player of $5 million per year. Clearly, there is potential for high earnings in Esports!</p>\n<h1 id=\"What-industries-is-Esports-impacting\"><a href=\"#What-industries-is-Esports-impacting\" class=\"headerlink\" title=\"What industries is Esports impacting?\"></a>What industries is Esports impacting?</h1><p>The Esports industry is continuing to grow, with new opportunities arising for those involved. But which industries is Esports impacting?</p>\n<p>One of the most obvious industries that Esports is impacting is the media industry. With spectators tuning in to watch tournaments and matches online and on TV, broadcasters are starting to take notice. In 2017, NBC Sports Group announced a multi-year agreement with ESL to broadcast the Intel Extreme Masters (IEM) worldwide. The deal saw coverage of various Esports tournaments on NBC networks such as NBC, NBCSN, and CNBC, as well as streaming on various digital platforms.</p>\n<p>This was followed up by Disney in 2018, when it announced an agreement with BAMTech (a subsidiary of Disney) to create a new dedicated ESPN+ Esport channel. The channel will air hundreds of live events per year, as well as on-demand content from some of the biggest names in Esports. This further cements Esports’ place in the mainstream media industry.</p>\n<p>Another industry that Esports is impacting is the video game industry. With competitive games such as League of Legends and DOTA 2 becoming popular spectator sports, developers are taking note. They are now designing their games with competitive features and spectating in mind, in a bid to attract and retain players. This has led to a rise in competitive gaming titles, which in turn has helped to drive the growth of the Esports industry.</p>\n<p>Esports is also having an impact on the marketing industry. With brands eager to tap into the lucrative Esports market, agencies are starting to offer dedicated services catering to this sector. From activations at major tournaments to creating branded content, agencies are helping brands reach out to the valuable Millennial demographic that participates in Esports.</p>\n<p>It’s clear that Esports is having a significant impact on multiple industries. As its popularity continues to grow, we can expect even more industries to be impacted in the future.</p>\n<h1 id=\"How-does-Esports-compare-to-traditional-sports\"><a href=\"#How-does-Esports-compare-to-traditional-sports\" class=\"headerlink\" title=\"How does Esports compare to traditional sports?\"></a>How does Esports compare to traditional sports?</h1><p>There is no one right answer to this question as Esports and traditional sports differ greatly in terms of their histories, structures, and audiences. However, there are some aspects of Esports that may give it an advantage over traditional sports.</p>\n<p>For one, Esports is growing at a much faster pace than traditional sports. In 2017, global revenue from Esports was estimated at $696 million, and it is expected to reach $1.5 billion by 2020[1]. This growth can be attributed to a number of factors, including the increasing popularity of online streaming platforms like Twitch, as well as the rising WCG (World Cyber Games) prize pools. Traditional sports, on the other hand, are seeing much slower growth rates. For example, global revenue for the NFL (National Football League) was estimated at $14 billion in 2017 and is projected to grow to only $19 billion by 2023[2].</p>\n<p>Another aspect in which Esports beats out traditional sports is in terms of viewership. The World Cup final between France and Croatia had an audience of about 3.4 million viewers[3], while the League of Legends World Championships final drew in nearly 100 million viewers[4]. This is largely due to the fact that Esports is broadcast online, whereas traditional sports are typically only available on television. As more and more people switch over to streaming services like Netflix and Hulu, the audience for Esports will continue to grow.</p>\n<p>The final factor that could give Esports an edge over traditional sports is its structure. In most cases, Esport tournaments are organized and run by private companies or by gamers themselves, whereas traditional sports are organized and regulated by national or international sporting organizations. This gives Esports a lot more flexibility in terms of how it operates and what kinds of games can be played. For example, the NFL has very strict rules about what players can and cannot do during a game, while Riot Games (the company behind League of Legends) can adjust the game mechanics as they see fit in order to create a more enjoyable experience for players and spectators.</p>\n<p>Despite these advantages, it’s important to note that traditional sports still have many advantages over Esports. For example, traditional sports are often tied to national pride and generate significant revenue from tickets sales, advertising, and broadcasting deals. Additionally, traditional sports offer a sense of community that is not always found in Esports communities. Players and fans alike can meet up in person and discuss their favorite teams or players, something that is not possible with online-only games like League of Legends or Counter-Strike: Global Offensive.</p>\n<p>In conclusion, while Esports may not be able to overtake traditional sports just yet, it does have some unique advantages that could lead to even greater growth in the future.</p>\n<h1 id=\"What-challenges-does-Esports-face\"><a href=\"#What-challenges-does-Esports-face\" class=\"headerlink\" title=\"What challenges does Esports face?\"></a>What challenges does Esports face?</h1><p>With Esports becoming a more mainstream activity, various challenges have arisen that the industry must now face. With such rapid growth, there are many different aspects of Esports that require further development in order to create a sustainable and healthy ecosystem.</p>\n<p>The first challenge is the need for a solid infrastructure. This includes having enough quality venues to hold tournaments as well as a well-developed broadcasting system. In order to truly tap into Esports’ commercial potential, sponsors and other third-party investors need to be able to see value in the space. A well-functioning infrastructure would not only provide this stability but also give fans a better experience.</p>\n<p>A second challenge is the lack of regulatory frameworks within the industry. This has led to inconsistent treatment of players and teams as well as different interpretations of what Esports actually is. Without proper regulation, it is difficult for businesses within Esports to plan for the long term and investors are hesitant to put money into what is seen as an unregulated market.</p>\n<p>A third challenge lies in the way that Esports are currently marketed. Oftentimes, sponsors and broadcasters focus on the violence and aggression aspects of Esports rather than on the competitive and strategic elements which appeal to many fans. Additionally, there is often a disconnection between players and fans which can hinder the growth of grassroots support for teams and players. Addressing these marketing challenges will be key in expanding the audience for Esports.</p>\n<p>Fourth, there is still a lack of understanding about Esports from traditional sports institutions such as governing bodies and sports media outlets. This can lead to exclusion from important conversations about traditional sports as well as missed opportunities for collaboration between Esports and traditional sports organisations. Developing positive relationships with these groups will be essential for legitimising Esports in the eyes of wider society.</p>\n<p>Finally, one of the most pressing challenges for Esports is overcoming its negative image among some members of society who see it as childish or irrelevant. Addressing these prejudices will require concerted effort from all stakeholders in the Esports industry while also stressing that competitive gaming can be rewarding both financially and mentally&#x2F;emotionally for participants.</p>\n<p>In conclusion, while there are several challenges facing Esports at present, they are by no means insurmountable. If industry stakeholders work together to address these issues, then there is great potential for continued growth in this dynamic field</p>\n","site":{"data":{}},"excerpt":"","more":"<h1 id=\"Why-is-Esports-growing-so-fast\"><a href=\"#Why-is-Esports-growing-so-fast\" class=\"headerlink\" title=\"Why is Esports growing so fast?\"></a>Why is Esports growing so fast?</h1><p> Esports is growing exponentially. This statement seems to be backed up by the fact that the global esports market is expected to grow from $696 million in 2017 to $1.5 billion by 2020, attaining a Compound Annual Growth Rate (CAGR) of 26.7%.</p>\n<p>A variety of factors are contributing to this rapid growth. Esport’s viewership numbers continue to rise; according to Newzoo, in 2017 there were over 380 million people worldwide who watched an esport event at least once a month, and this is expected to grow to 545 million by 2020. There are many reasons for this growth; Esports provides an opportunity for audiences to see competitive gaming at the highest level, it is easily accessible thanks to online streaming platforms such as Twitch, and gaming itself is becoming more mainstream with each year that passes. In addition, brands are beginning to see the potential in advertising through eSports events and platforms, which will only add fuel to the fire as the industry continues to grow.</p>\n<p>Esports has also begun branching out into other areas beyond just video gaming. For example, there are now major League of Legends tournaments being held in stadiums packed with fans, and teams are starting to be signed by professional sports clubs such as NBA’s Golden State Warriors and NFL’s Philadelphia Eagles. The potential for income within eSports is also beginning to be realised; Michael Morhaime, CEO of Activision Blizzard (the company behind games such as World of Warcraft, Hearthstone and Starcraft), said in a recent earnings call that they plan to invest $500 million into eSports in the next three years alone. This investment will go towards creating new leagues and expanding current ones, building new arenas around the world and expanding live broadcasts of events.</p>\n<p>As you can see, there are many reasons why Esports is growing so rapidly - it provides an enjoyable experience for viewers, it is easily accessible and mainstream, brands are beginning to invest heavily and it is branching out into other areas. With all of these factors working together, it seems safe to say that the growth of Esports is only going to continue for many years to come.</p>\n<h1 id=\"What-are-the-benefits-of-Esports\"><a href=\"#What-are-the-benefits-of-Esports\" class=\"headerlink\" title=\"What are the benefits of Esports?\"></a>What are the benefits of Esports?</h1><p>The global phenomenon that is Esports is continuing to grow in popularity, with new tournaments and leagues cropping up all the time. Esports is now a multi-billion dollar industry, and viewership for major events regularly exceeds that of traditional sporting fixtures. So what are the benefits of Esports?</p>\n<p>There are many reasons why Esports is so popular, but here are just a few of the key benefits:</p>\n<ol>\n<li>Esport athletes are often young, fit, and healthy.</li>\n</ol>\n<p>Due to the physicality of some Esports games, many professional players are in excellent shape. This is in contrast to traditional sports stars who are often older and more susceptible to injury.</p>\n<ol start=\"2\">\n<li>Esport athletes are typically highly skillful.</li>\n</ol>\n<p>Esports games require good hand-eye coordination as well as strategic thinking skills. As a result, professional players tend to be extremely skilled at playing their chosen game.</p>\n<ol start=\"3\">\n<li>Esport athletes are typically well-paid.</li>\n</ol>\n<p> MLG’s report on “The State of the Industry: 2017” showed that the average salary for an Esports athlete was $62,000 per year. This is in comparison to the average salary for a professional basketball player of $5 million per year. Clearly, there is potential for high earnings in Esports!</p>\n<h1 id=\"What-industries-is-Esports-impacting\"><a href=\"#What-industries-is-Esports-impacting\" class=\"headerlink\" title=\"What industries is Esports impacting?\"></a>What industries is Esports impacting?</h1><p>The Esports industry is continuing to grow, with new opportunities arising for those involved. But which industries is Esports impacting?</p>\n<p>One of the most obvious industries that Esports is impacting is the media industry. With spectators tuning in to watch tournaments and matches online and on TV, broadcasters are starting to take notice. In 2017, NBC Sports Group announced a multi-year agreement with ESL to broadcast the Intel Extreme Masters (IEM) worldwide. The deal saw coverage of various Esports tournaments on NBC networks such as NBC, NBCSN, and CNBC, as well as streaming on various digital platforms.</p>\n<p>This was followed up by Disney in 2018, when it announced an agreement with BAMTech (a subsidiary of Disney) to create a new dedicated ESPN+ Esport channel. The channel will air hundreds of live events per year, as well as on-demand content from some of the biggest names in Esports. This further cements Esports’ place in the mainstream media industry.</p>\n<p>Another industry that Esports is impacting is the video game industry. With competitive games such as League of Legends and DOTA 2 becoming popular spectator sports, developers are taking note. They are now designing their games with competitive features and spectating in mind, in a bid to attract and retain players. This has led to a rise in competitive gaming titles, which in turn has helped to drive the growth of the Esports industry.</p>\n<p>Esports is also having an impact on the marketing industry. With brands eager to tap into the lucrative Esports market, agencies are starting to offer dedicated services catering to this sector. From activations at major tournaments to creating branded content, agencies are helping brands reach out to the valuable Millennial demographic that participates in Esports.</p>\n<p>It’s clear that Esports is having a significant impact on multiple industries. As its popularity continues to grow, we can expect even more industries to be impacted in the future.</p>\n<h1 id=\"How-does-Esports-compare-to-traditional-sports\"><a href=\"#How-does-Esports-compare-to-traditional-sports\" class=\"headerlink\" title=\"How does Esports compare to traditional sports?\"></a>How does Esports compare to traditional sports?</h1><p>There is no one right answer to this question as Esports and traditional sports differ greatly in terms of their histories, structures, and audiences. However, there are some aspects of Esports that may give it an advantage over traditional sports.</p>\n<p>For one, Esports is growing at a much faster pace than traditional sports. In 2017, global revenue from Esports was estimated at $696 million, and it is expected to reach $1.5 billion by 2020[1]. This growth can be attributed to a number of factors, including the increasing popularity of online streaming platforms like Twitch, as well as the rising WCG (World Cyber Games) prize pools. Traditional sports, on the other hand, are seeing much slower growth rates. For example, global revenue for the NFL (National Football League) was estimated at $14 billion in 2017 and is projected to grow to only $19 billion by 2023[2].</p>\n<p>Another aspect in which Esports beats out traditional sports is in terms of viewership. The World Cup final between France and Croatia had an audience of about 3.4 million viewers[3], while the League of Legends World Championships final drew in nearly 100 million viewers[4]. This is largely due to the fact that Esports is broadcast online, whereas traditional sports are typically only available on television. As more and more people switch over to streaming services like Netflix and Hulu, the audience for Esports will continue to grow.</p>\n<p>The final factor that could give Esports an edge over traditional sports is its structure. In most cases, Esport tournaments are organized and run by private companies or by gamers themselves, whereas traditional sports are organized and regulated by national or international sporting organizations. This gives Esports a lot more flexibility in terms of how it operates and what kinds of games can be played. For example, the NFL has very strict rules about what players can and cannot do during a game, while Riot Games (the company behind League of Legends) can adjust the game mechanics as they see fit in order to create a more enjoyable experience for players and spectators.</p>\n<p>Despite these advantages, it’s important to note that traditional sports still have many advantages over Esports. For example, traditional sports are often tied to national pride and generate significant revenue from tickets sales, advertising, and broadcasting deals. Additionally, traditional sports offer a sense of community that is not always found in Esports communities. Players and fans alike can meet up in person and discuss their favorite teams or players, something that is not possible with online-only games like League of Legends or Counter-Strike: Global Offensive.</p>\n<p>In conclusion, while Esports may not be able to overtake traditional sports just yet, it does have some unique advantages that could lead to even greater growth in the future.</p>\n<h1 id=\"What-challenges-does-Esports-face\"><a href=\"#What-challenges-does-Esports-face\" class=\"headerlink\" title=\"What challenges does Esports face?\"></a>What challenges does Esports face?</h1><p>With Esports becoming a more mainstream activity, various challenges have arisen that the industry must now face. With such rapid growth, there are many different aspects of Esports that require further development in order to create a sustainable and healthy ecosystem.</p>\n<p>The first challenge is the need for a solid infrastructure. This includes having enough quality venues to hold tournaments as well as a well-developed broadcasting system. In order to truly tap into Esports’ commercial potential, sponsors and other third-party investors need to be able to see value in the space. A well-functioning infrastructure would not only provide this stability but also give fans a better experience.</p>\n<p>A second challenge is the lack of regulatory frameworks within the industry. This has led to inconsistent treatment of players and teams as well as different interpretations of what Esports actually is. Without proper regulation, it is difficult for businesses within Esports to plan for the long term and investors are hesitant to put money into what is seen as an unregulated market.</p>\n<p>A third challenge lies in the way that Esports are currently marketed. Oftentimes, sponsors and broadcasters focus on the violence and aggression aspects of Esports rather than on the competitive and strategic elements which appeal to many fans. Additionally, there is often a disconnection between players and fans which can hinder the growth of grassroots support for teams and players. Addressing these marketing challenges will be key in expanding the audience for Esports.</p>\n<p>Fourth, there is still a lack of understanding about Esports from traditional sports institutions such as governing bodies and sports media outlets. This can lead to exclusion from important conversations about traditional sports as well as missed opportunities for collaboration between Esports and traditional sports organisations. Developing positive relationships with these groups will be essential for legitimising Esports in the eyes of wider society.</p>\n<p>Finally, one of the most pressing challenges for Esports is overcoming its negative image among some members of society who see it as childish or irrelevant. Addressing these prejudices will require concerted effort from all stakeholders in the Esports industry while also stressing that competitive gaming can be rewarding both financially and mentally&#x2F;emotionally for participants.</p>\n<p>In conclusion, while there are several challenges facing Esports at present, they are by no means insurmountable. If industry stakeholders work together to address these issues, then there is great potential for continued growth in this dynamic field</p>\n"}],"PostAsset":[],"PostCategory":[{"post_id":"cl7kcem2b0001s8v5garh96k9","category_id":"cl7kcem2j0003s8v50kyy8w43","_id":"cl7kcem2l0004s8v50d3l2594"}],"PostTag":[],"Tag":[]}}